{"DataJson": [{"NAME": ["MANJUNADHREDDY PARUPATI", "Manjunadh Reddy Parupati\r ", "Ram Reddy"], "LOCATION": ["Hyderabad"], "PHONE NUMBER": ["+91 9346025470"], "PREVIOUS COMPANY": ["Tata Consultancy Services: From October 2017 until now.\r Position: Associate Software Engineer"], "Project Name": ["Data Collection System\r Platform: Node.js, Azure Cosmos DB, Azure Storage Accounts (blob storage)\r and Azure Functions\r Description:\r Data collection system for analysing equipment or factory performance.\r \r \f\r \r \r Data Collection System App is a provision to enter the monthly Overall\r Equipment Efficiency (OEE), Productivity, Quality and Safety parameters\r manually into this application.\r Will retain all the functional requirements and provide a simple, intuitive way to\r collect a common set of Key Performance Indicators (KPIs) from\r factories/sites/plant.\r \r Role:\r  Developed API’s using Azure functions to fetch and update the server data to\r Azure cosmos Db and Blob storage.\r \r \r Involved in building various logics for validating data and fetching datafrom\r Azure Cosmos Db using SQL queries.\r \r Skills\r ", "Factory Quality Standards\r Platform: Angular Js, Node.js, Azure Cosmos DB and Azure App Services\r Description:\r  Factory Quality Standards is predominantly designed to track quality and\r quantity analysis of shipped goods from the factory.\r  Business use FQS to raise tickets and track them, if they receive any\r damaged goods.\r  Show a comprehensive dashboard’s of all the damaged goods, both from\r consumer and customer.\r Role:\r  Developed API’s to fetch and update the server data to Azure cosmos Db and\r Blob storage.\r  Deployed sonarQube an automatic code review tool to detect bugs,\r vulnerabilities and code smells in your code and integrate with existing\r workflow to enable continuous code inspection across your project branches\r and pull requests.\r b. Project Title:"], "Programming_Language": ["JavaScript, C\r Markup Languages: HTML\r Libraries"], "DATABASE": ["MySQL, Mongo DB, Node.js, Azure Cosmos DB, Azure\r Blob Storage, Azure Functions\r Methodology: Agile, Waterfall\r \r "]}]}